#define _CRT_SECURE_NO_WARNINGS
//操作符
//算术操作符：+-*/%
// /整型的除法  取整数部分
// 浮点型的除法   该是啥就是啥（小数位数的取）
// 1/2.0     1.0/2.0   1/2.0
// % 整除后的余数  两端必须都是整数
// 
// 
#include<stdio.h>
//蛋哥C语言
//int main()
//{
//	int a = 7 % 2;
//	int b = 7 / 2;
//	printf("%d\n",a);
//	printf("%d\n", b);
//
//	return 0;
//}

//移位操作符：二进制
//左移操作符
//右移操作符
//十进制0~9
//二进制0~1
//八进制0~7
//十六进制0~f
//整数的二进制表示有3种
//原码
//反码
//补码
//正整数的原反补码相同
//

//int main()
//{
//	int a = 3;
//	int b =a << 1;//左移操作符——移动二进制位
//	printf("%d   %d",a,b);
//}
//左操作符
//左边抛弃，右边补0
//整体左移

//右移操作符
//逻辑移位：左边补0，右边丢弃
//算数移位：左边用原该值的符号位填充，右边丢弃
//对于移位运算符，不要移动负数位，这个是标准未定义的。
//int main()
//{
//	int a = -3;
//	int b =a >> 1;//右移操作符
//	printf("%d \n%d",a,b);
//}

//位操作符
//&按位与
//|按位或
//^按位异或
//!非

//面试题：不能创建临时变量，实现两个数的交换
//int main()
//{
//	int a = 0, b = 0;
//	scanf("%d%d",&a,&b);
//	printf("交换前，a=%d,b=%d\n", a, b);
//	//交换
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//
//	printf("交换后，a=%d,b=%d", a, b);
//
//	return 0;
//}
//异或具有对称性；如果一个密文x，一个秘钥|公钥y
//明文w=x^y
//密文x=w^y

//编写代码实现：求一个整数存储在内存中的二进制中1的个数